rails-two/app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("content", "status", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "show up"], ["status", "t"], ["list_id", 1], ["created_at", "2018-03-10 00:14:21.470514"], ["updated_at", "2018-03-10 00:14:21.470514"]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "status" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["status", "t"], ["updated_at", "2018-03-10 00:18:10.564925"], ["id", 2]]