rails-two/week-one/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("name", "content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "olivia steger"], ["content", "hello olivia"], ["post_id", 1], ["created_at", "2018-03-09 18:29:48.306637"], ["updated_at", "2018-03-09 18:29:48.306637"]]