rails-two/week-one/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "hello i'm olivia"], ["user_id", 1], ["created_at", "2018-03-09 18:29:31.950504"], ["updated_at", "2018-03-09 18:29:31.950504"]]