rails-two/week-one/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "olivia steger"], ["age", 13], ["created_at", "2018-03-09 18:29:19.227788"], ["updated_at", "2018-03-09 18:29:19.227788"]]