rails/class-four/app/controllers/animals_controller.rb

  def create
    params.permit!

    @animal = Animal.new(params[:animal])

    if @animal.save
---
INSERT INTO "animals" ("name", "age", "kind", "food") VALUES (?, ?, ?, ?)  [["name", "belinda"], ["age", 2], ["kind", "lizard"], ["food", "steak"]]

  def update
    params.permit!

    @animal = Animal.find(params[:id])
    @animal.update_attributes(params[:animal])
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "animals" SET "kind" = ?, "food" = ? WHERE "animals"."id" = ?  [["kind", "pear"], ["food", "treats"], ["id", 10]]

  def show
    @animal = Animal.find(params[:id])
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @animal = Animal.find(params[:id])
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def clear
    Animal.destroy_all
---
DELETE FROM "animals" WHERE "animals"."id" = ?  [["id", 1]]