rails/hw-five/app/controllers/visits_controller.rb

  def create
    params.permit!

    @visit = Visit.new(params[:visit])

    if @visit.save
---
INSERT INTO "visits" ("visitor", "animal_id") VALUES (?, ?)  [["visitor", "olivia"], ["animal_id", 5]]