rails/hw-two/app/controllers/animals_controller.rb

  def create
    params.permit!
    @animal = Animal.new(params[:animal])

    if @animal.save
---
INSERT INTO "animals" ("name", "age", "kind") VALUES (?, ?, ?)  [["name", "Lorraine"], ["age", 13], ["kind", "zebra"]]

  def show
    @animal = Animal.find(params[:id])
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]